# 1. Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод __init__()),
# который должен принимать данные (список списков) для формирования матрицы.
# Подсказка: матрица — система некоторых математических величин, расположенных в виде прямоугольной схемы.
# Примеры матриц вы найдете в методичке.
# Следующий шаг — реализовать перегрузку метода __str__() для вывода матрицы в привычном виде.
# Далее реализовать перегрузку метода __add__() для реализации операции сложения двух объектов класса Matrix (двух матриц).
# Результатом сложения должна быть новая матрица.
# Подсказка: сложение элементов матриц выполнять поэлементно — первый элемент первой строки первой матрицы складываем с первым элементом первой
# строки второй матрицы и т.д.


class Matrix:
    def __init__(self, list_1, list_2):
        self.list_1 = list_1
        self.list_2 = list_2

    def __add__(self):
        matrix_1 = [[0, 0, 0],
               [0, 0, 0],
               [0, 0, 0]]

        for a in range(len(self.list_1)):
            for b in range(len(self.list_2[a])):
                matrix_1[a][b] = self.list_1[a][b] + self.list_2[a][b]

        return str('\n'.join(['\t'.join([str(b) for b in a]) for a in matrix_1]))

    def __str__(self):
        return str('\n'.join(['\t'.join([str(b) for b in a]) for a in matrix_1]))

result = Matrix([[1, 2, 3],
                 [4, 5, 6],
                 [7, 8, 9]],
                [[9, 8, 7],
                 [6, 5, 4],
                 [3, 2, 1]])

print(result.__add__())
